--김수호--

--준비 EMPLOYEE테이블, DEPARTMENT테이블, JOB테이블의 전체정보를 조회하세요



--문제1. EMPLOYEE테이블에서 사원번호가 215보다 크고(초과) 220보다 작으면서(미만) 
-- 성별이 남자인 사원의 이름,부서코드를 조회하세요.



--문제2. 부서코드가 D1,D5인 사원의 사원명, 부서명, 연봉을 조회하세요.
-- 컬럼별로 별칭을 부여하세요
-- ANSI, ORACLE 문법 각각 사용

--ORACLE


--ANSI



--문제3. 직급이 대리이면서 전화번호가 011로 시작하는 사원의 사원명 , 전화번호를 조회하세요
--EX) Sooho@naver.com 일 경우 Sooho만 조회
--컬럼별로 별칭 부여
--ANSI, ORACLE 표준문법 사용

--ORACLE



--ANSI

--문제4. 남자인 사원들에서 급여(SALARY)가 높은순으로 순위(RANK)를 정한 후 3위까지의 사원번호, 사원명, 입사일,급여를 조회하세요
--서브쿼리문 사용
--컬럼별 별칭 부여

--문제5.부서별  부서코드,부서명, 평균급여, 최대급여, 최소급여를 조회하세요
--평균급여는 백의자리 까지만 조회하세요
--ANSI, ORACLE 표준문법 각각사용
--컬럼별 별칭부여




--문제6.
--EMPLOYEE테이블에서 보너스를 받지못하는 사원들의 사원명과 입사 년도, 월, 일 을 각각 조회하세요
--이때 컬럼별로 별칭을부여하고, YYYY년도
--                                             MM월
--                                             DD일
--별칭(입사년도, 입사월, 입사일)
--로 년도,월,일 을 붙혀서 조회하세요






